Autodesk.Revit.DB.BuiltInFailures.LoadFailures.PointLoadNotOverlappingHost
Point load is not overlapping with its entire distribution its host.

Autodesk.Revit.DB.BuiltInFailures.LoadFailures.OpenAreaLoadLoopError
Area Load Sketch can't contain open loops.

Autodesk.Revit.DB.BuiltInFailures.LoadFailures.LineLoadNotOverlappingHost
Line load is not overlapping with its entire distribution its host.

Autodesk.Revit.DB.BuiltInFailures.LoadFailures.InvalidAreaLoadSketchError
Area Load has invalid Sketch.

Autodesk.Revit.DB.BuiltInFailures.LoadFailures.AreaLoadNotOverlappingHost
Area load is not overlapping with its entire distribution its host.